-- phpMyAdmin SQL Dump
-- version 4.0.10deb1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1

-- База данных: `japan`
--

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `short_content` text NOT NULL,
  `content` text NOT NULL,
  `preview` varchar(255) NOT NULL,
  `type` varchar(50) DEFAULT NULL,
  `category_id` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `title`, `date`, `short_content`, `content`, `preview`, `type`, `category_id`) VALUES
(1, 'Овощная кондитерская: в Японии готовят уникальные торты-салаты.', '2016-05-12 13:05:04', '<p>В одном из ресторанов японской Нагои подают салаты, которые на первый взгляд легко спутать с произведениями кондитерского искусства.</p>', '<p>В одном из ресторанов японской Нагои подают салаты, которые на первый взгляд легко спутать с произведениями кондитерского искусства. Владельцы кафе рассказывают, что их торты точно не испортят фигуру, ведь они приготовлены из овощей, в них нет ни грамма сахара и пшеничной муки. Коржи для этих угощений выпекают из соевой муки, а вместо крема используют тофу. Сейчас в меню кафе около 50 тортов.</p>', 'images/news/news1.jpg', 'NewsPublication', 3),
(2, 'Невозможная планета: мог ли Меркурий образоваться в Солнечной системе', '2016-05-12 00:00:00', '<p>Учёные из Японии выяснили, что Меркурий почти ни при каких обстоятельствах не мог образоваться в Солнечной системе. Более того, при построении компьютерных моделей даже похожие на него планеты возникали довольно редко. В отличие от планет земного типа, которые в ходе моделирования получались регулярно. Как в Солнечной системе мог оказаться Меркурий — в материале RT.</p>', '<p>Исследовательская группа из Университета Кинки при помощи компьютерного моделирования воспроизвела процесс формирования планет земной группы (Меркурий, Венера, Земля, Марс) в Солнечной системе. Особое внимание учёные уделили Меркурию, который находится ближе всего к Солнцу. Среднее расстояние между планетой и звездой составляет 58 млн км. Планетологи решили выяснить, в какой части Солнечной системы мог образоваться Меркурий. Однако, согласно их выводам, вероятность того, что планета в принципе сформировалась в этой системе, невелика. </p>\n\n<p>Учёные построили компьютерные модели с учётом различных факторов: наличия «зародышей» планет — веществ, которые позволяют им набирать массу, и процессов, которые происходят во время формирования планет. Они предприняли 110 попыток моделирования процессов в той зоне, где находится Меркурий. В результате планеты образовывались лишь 52 раза, среди них похожие на Меркурий — только в девяти случаях. </p>\n\n<p>Планеты образовывались, если в так называемом протопланетном диске находилось около 100 «зародышей» и 6 тыс. планетезималей (тел на орбите протозвезды, которые формируются из частиц пыли протопланетного диска). Обычно при образовании планет планетезимали соединяются и образуют более крупные тела. В построенных моделях все аналоги Меркурия, кроме одного, образовывались из концентрированных сгустков пыли протопланетного диска, которые постепенно уплотнялись. Получившиеся небесные тела оказывались на расстоянии немного меньше среднего расстояния между Меркурием и Солнцем — от 0,27 до 0,34 астрономических единиц. Формирование сравнимых с Меркурием по массе планет занимало около 10 млн лет. </p>\n\n<p>Стоит также отметить, что часто модель демонстрировала вероятность формирования Венеры и Земли. Иными словами, учёным в целом удалось воссоздать процесс образования системы, похожей на Солнце с наиболее близкими планетами. Марс, как и Меркурий, образовался только в 9 случаях. </p>\n\n<p>Местный или чужестранец? </p>\n\n<p>Происхождение и формирование самой маленькой планеты Солнечной системы (не считая Плутона) давно волнует исследователей. Меркурий имеет железное ядро, довольно тонкую каменистую оболочку и странную по сравнению с другими планетами орбиту. Он перемещается по вытянутой траектории, то приближаясь к Солнцу на 46 млрд км, то удаляясь на 70 млрд км. Такие орбиты могут получаться, если «блуждающая» планета, образовавшаяся в другой системе, попала под влияние силы тяготения звезды. Но против такой версии говорят данные о составе Марса. Также в известных случаях захвата планеты звездой «пришелец» оказывается на краю планетной системы. </p>\n\n<p>Кроме того, снимки аппарата NASA Messenger предоставили интересные данные о рельефе планеты. Извержения вулканов на Меркурии начались около 3,5 млрд лет назад, а закончились только около миллиарда лет назад. Однако такой продолжительной вулканической активности на Меркурии, сформировавшемся около 4,5 млрд лет назад, быть не могло, если он образовался рядом с Солнцем. Эти данные позволяют предположить, что Меркурий мог по меньшей мере образоваться на более далёкой орбите, а потом приблизиться на современную. Модели, построенные учёными из Японии, также свидетельствовали о том, что первая планета от Солнца могла изменить орбиту и приблизиться к звезде. </p>\n\n<p>Исследователи отмечают, что ни в одной из построенных моделей не получилось сформировать точную копию Меркурия. Даже самые близкие аналоги представляли собой более массивные планеты. При этом ни одного аналога дальше расстояния в 0,6 астрономических единиц не\nобразовалось. Другие астрономы ранее уже выдвигали версию о том, что новообразованный Меркурий был массивнее современного. Прото-Меркурий, когда его формирование уже было закончено, мог столкнуться с другим крупным небесным телом. На раннем этапе жизни Солнечной системы такие события были нередки. В результате столкновения планета могла потерять значительную часть своей коры. Это объяснило бы и сравнительно крупное ядро при тонкой оболочке. Однако этот сценарий авторы работы не рассматривают. </p>\n\n<p>Даже при небольших шансах образования Меркурия на расстоянии от 0,3 до 0,6 астрономических единиц от Солнца исследователи намерены продолжать изучать именно этот вариант. Из всех способов возможного образования этой планеты во внутренней части Солнечной системы он считается наиболее вероятным.</p>', 'images/news/news2.jpg', 'NewsPublication', 1),
(3, 'Страна весеннего солнца: в Японии зацвела сакура', '2016-05-12 00:00:00', '<p>В городке Кавадзу на востоке Японии расцвела сакура: около восьми тысяч деревьев дикой вишни окрасились в розовое.</p>', '<p>В городке Кавадзу на востоке Японии расцвела сакура: около восьми тысяч деревьев дикой вишни окрасились в розовое.</p> \n				Цветение сакуры обычно начинается в конце марта или начале апреля, однако в этом году весна в Кавадзу пришла на месяц раньше. \n				Сотни туристов приезжают в город полюбоваться удивительным зрелищем.</p>', 'images/news/news3.jpg', 'NewsPublication', 3),
(4, 'Фукусима примет матчи по бейсболу и софтболу на Олимпийских играх в 2020 году', '2016-05-12 00:00:00', '<p>Японский город Фукусима примет матчи олимпийских турниров по бейсболу и софтболу в 2020 году вместе с Токио.</p>', '<p>Японский город Фукусима примет матчи олимпийских турниров по бейсболу и софтболу в 2020 году вместе с Токио. \n				«Игры пройдут в Токио, но как минимум один матч, скорее всего, матч-открытие, пройдёт в Фукусиме», — цитирует Reuters главу организационного комитета Игр Йосиро Мори. \n\n				Мори добавил, что идея перенести некоторые соревнования в Фукусиму появилась в октябре 2016 года у президента МОК Томаса Баха и премьер-министра Японии Синдзо Абэ.</p>', 'images/news/news4.jpg', 'NewsPublication', 2),
(5, 'День совершеннолетия в Японии', '2017-05-12 00:00:00', '<p>В Японии отмечают День совершеннолетия, который является государственным праздником.</p>', '<p>В Японии отмечают День совершеннолетия, который является государственным праздником. В торжествах принимают участие все японцы, которым в нынешнем году уже исполнилось или исполнится 20 лет.\n\nВ этот день девушки наряжаются в традиционные кимоно с длинными рукавами фурисодэ и меховую накидку. Юноши надевают строгие костюмы или мужские кимоно. В честь виновников торжества городские власти устраивают праздничные мероприятия и вручают памятные подарки.</p> ', 'images/news/news5.jpg', 'NewsPublication', 3);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  `email` varchar(60) NOT NULL,
  `theme` text NOT NULL,
  `message` longtext NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=24 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `theme`, `message`) VALUES
(14, '1', 'yygy@gmail.com', '3', '4'),
(15, 'we', 're@fds.fd', 'dfs', 'fff'),
(16, 'we', 're@fds.fd', 'dfs', 'fff'),
(18, '123', 'r@g.rt', 'fdfs', 'ghbfn'),
(19, 'Петр', 'petr@gmail.com', 'Привет, я Петр', 'Привет, я Петр'),
(20, 'Anoriar', 'fsdf@mail.com', 'fdsfs', 'fsdfsd'),
(21, 'alex', 'alex@mail.ru', 'Привет', '++++'),
(22, 'anoriar', 'ano@gmail.com', 'Hi', 'Привет'),
(23, 'ale', 'ert@mail.ru', 'das', 'asffgdg');

--
-- Структура таблицы `categories`
--
CREATE TABLE IF NOT EXISTS `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `categories` (`id`, `name`) VALUES
(1, 'Наука'),
(2, 'Спорт'),
(3, 'Прочее');

--
-- Структура таблицы `gallery`
--
CREATE TABLE IF NOT EXISTS `gallery` (
  `id` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `gallery` (`id`, `image`) VALUES
(1, 'images/gallery/g1.jpg'),
(2, 'images/gallery/g2.jpg'),
(3, 'images/gallery/g3.jpg'),
(4, 'images/gallery/g4.jpg'),
(5, 'images/gallery/g5.jpg'),
(6, 'images/gallery/g6.jpg'),
(7, 'images/gallery/g7.jpg'),
(8, 'images/gallery/g8.jpg'),
(9, 'images/gallery/g9.jpg'),
(10, 'images/gallery/g10.jpg'),
(11, 'images/gallery/g11.jpg'),
(12, 'images/gallery/g12.jpg'),
(13, 'images/gallery/g13.jpg');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
